-- 5.  Выведите таблицу со средними оценками студентов группы 4100 (Номер, ФИО, Ср_оценка),
-- у которых средняя оценка не больше максимальной оценк(е|и) в группе 3100.

SELECT
    "Н_ЛЮДИ"."ИД" as "Номер",
    concat_ws(
            ' ',
            "Н_ЛЮДИ"."ФАМИЛИЯ",
            NULLIF("Н_ЛЮДИ"."ИМЯ", '.'),
            NULLIF("Н_ЛЮДИ"."ОТЧЕСТВО", '.'))
                  AS
                     "ФИО",
    avg("Н_ВЕДОМОСТИ"."ОЦЕНКА"::integer)
                  AS
                     "Ср_оценка"

FROM "Н_ЛЮДИ"
         JOIN
            "Н_ВЕДОМОСТИ"
         ON
             "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"

         JOIN
            "Н_ОЦЕНКИ"
         ON
            "Н_ОЦЕНКИ"."КОД" = "Н_ВЕДОМОСТИ"."ОЦЕНКА"
            AND char_length("Н_ВЕДОМОСТИ"."ОЦЕНКА") = 1 --чтобы были только 2-5

        JOIN
            "Н_ОБУЧЕНИЯ"
        ON
            "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"

        JOIN
            "Н_УЧЕНИКИ"
        ON
            "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
            AND "Н_УЧЕНИКИ"."ГРУППА" = '4100'

GROUP BY
    "Н_ЛЮДИ"."ИД",
    "Н_ЛЮДИ"."ФАМИЛИЯ",
    "Н_ЛЮДИ"."ИМЯ",
    "Н_ЛЮДИ"."ОТЧЕСТВО"

HAVING
    avg("Н_ВЕДОМОСТИ"."ОЦЕНКА"::integer) <=
    (SELECT
         MAX("ОЦЕНКА"::integer)
     FROM
         "Н_ЛЮДИ"
         JOIN
             "Н_ВЕДОМОСТИ"
         ON
             "Н_ВЕДОМОСТИ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"

         JOIN
             "Н_ОЦЕНКИ"
         ON
             "Н_ОЦЕНКИ"."КОД" = "Н_ВЕДОМОСТИ"."ОЦЕНКА"
             AND char_length("ОЦЕНКА") = 1

         JOIN
             "Н_ОБУЧЕНИЯ"
         ON
             "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД" = "Н_ЛЮДИ"."ИД"

         JOIN
             "Н_УЧЕНИКИ"
         ON
             "Н_УЧЕНИКИ"."ЧЛВК_ИД" = "Н_ОБУЧЕНИЯ"."ЧЛВК_ИД"
             AND "Н_УЧЕНИКИ"."ГРУППА" = '3100')

ORDER BY "Ср_оценка"